[
  {
    "path": "resources/2021-02-07 AI and Settlement Failures/",
    "title": "AI and Settlement Failures [Public]",
    "description": "With the implementation of the SDR in 2022, investment firms are looking into AI to help early detection of potential trade fails. See BNY Mellon/Google and Deutsche Bank/Elastic initiatives. My thoughts: don't forget that AI helps to detect and alert potential fails early. It does not mean that it can eliminate them for you. So, you have one year to think about new SOPs when you have AI telling you the minute you execute the trades that they are at risk of failing. Read more below...",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2021-02-07",
    "categories": [
      "Interests"
    ],
    "contents": "\nHere’s a simple scenario. A trader buys Bond A for USD1m. On the same day, he sells Bond B for USD1m. The traded cash position in the portfolio is USD700k, assuming no other transactions. The trader is then alerted by AI on trade date that there is a high likelihood Bond B’s cash settlement will be received late in the day. But, you need to have the funds earlier for custody to settle Bond A. What do you do? What different action would you have taken with and without AI? I’d say the difference is: without AI, since no one anticipated anything, current practice means no action would be taken until settle date when chaos starts. Worst case, re-book the trade with amended settle date (yes, possible in Malaysia OTC trade) but still technically a failed trade. With AI, perhaps the trader could allocate at least USD300k into short-term instruments and on settle date, can be easily instructed to move to the cash account that pays Bond A. Or to be safe, the trader limits his purchase of Bond A to USD700k.\nWe don’t know if AI sends alert before the trade is executed, but that’s going to be a different issue. To give a more realistic example, if the AI says the likelihood of fail trade is 72%, what is your best course of action? Is the AI programmed to suggest an optimal action? Who is going to make a decision - the trader or the middle office? Will the risk managers help to make things simple and more clear-cut by implementing a pre-trade compliance rule that disallow anything above 80%?\nAI helps to improve certain critical areas, but to take full advantage of its benefit also requires re-thinking new processes. And that means new operational functions and responsibilities, and certainly development of new systems. AI is a game changer that gives you valuable data, but if it is treated merely as a data, it is not going to useful at all.\nDraw up the scenario if you plan to adopt AI. There’s going to be a lot of scenarios to cover for the new SOP that’s going to impact both front and back office. If no AI is involved, new measures would still need to be implemented and could possibly be equally effectively. More studies are required to compare the impact of AI vs no AI in addressing fail trades.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-08T00:01:37+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-12-31 List of Investment Technology and Consulting Companies/",
    "title": "List of Investment Technology and Consulting Companies [Public]",
    "description": "To be uploaded soon.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2021-01-30",
    "categories": [
      "Information"
    ],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:42:37+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2021-01-30 Insights into Procurement and Implementation Process/",
    "title": "Insights into Investment Systems Procurement and Implementation Process",
    "description": "An in-depth analysis on the selection through to successful implementation of front-office and back office systems. Rather than focusing on a generic implementation model, the objective is to highlight early detection of issues, system capabilities, skills transition, implementation risks, resolution and many other concerns unique to procuring new investment systems to ensure investment managers fully benefit from the new technology, information delivery and operational workflow.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2021-01-30",
    "categories": [
      "Presentation"
    ],
    "contents": "\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:43:27+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-11-23 Constant Yield Amortisation Methodologies/",
    "title": "Constant Yield Amortisation: 3 Main Methodologies [Public]",
    "description": "There have been many questions regarding yield-dependent formulas such as duration and amortised book values due to different systems showing different numbers. Software vendors will not share their proprietary algorithm because it potentially raise more questions than answers. I attempt to give you the answer here, and also why most fund managers in Malaysia use the \"least suitable\" method recommended by one of the Big 4.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-11-23",
    "categories": [
      "Presentation"
    ],
    "contents": "\nClick here to view slides\n\n\n\n",
    "preview": "resources/2020-11-23 Constant Yield Amortisation Methodologies/slides/Bond Amortisation Calculation Methods.001.jpeg",
    "last_modified": "2021-02-07T00:41:33+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-05-10 RTutorial/",
    "title": "R Tutorial [Public]",
    "description": "R Tutorial",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-10-05",
    "categories": [
      "Programming"
    ],
    "contents": "\nSession 1 - Introduction to R\nSession 2 - The R Environment\nSession 3 - Coding - Arithmetic Operators\nSession 4 - Coding - Operators, Vectors, Matrices and Lists\nSession 5 - Coding - Data Frames\nSession 6 - Coding - Loops and Functions\nSession 7 - Coding - Formatting\nSession 8 - Graphs\nSession 9 - Accessing Data\nSession 10 - dplyr\nSession 11 - R Markdown\nSession 12 - Flex Dashboard, htmlwidgets and Shiny\nSession 13 - R Markdown Websites and Github\nSession 14 - Creating Packages\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-06T14:33:49+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-08-01 Blueprint OTC Market Hub/",
    "title": "Blueprint: OTC Market Hub",
    "description": "Marketplace for participants trading OTC instruments.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-08-01",
    "categories": [
      "Blueprint"
    ],
    "contents": "\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:40:19+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-08-01 Blueprint thinkRecon/",
    "title": "Blueprint: thinkRecon",
    "description": "thinkRecon is a framework that combines customised automation tools, processes and specialised skills in investment data management to detect and resolve data issues; and provide data quality ratings.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-08-01",
    "categories": [
      "Blueprint"
    ],
    "contents": "\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:40:53+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-10 Data Maintenance Automation,  Accuracy, Timeliness and Self-Check Mechanism/",
    "title": "Data Maintenance Automation, Accuracy, Timeliness and Self-Check Mechanism",
    "description": "Case study on data management. This is not about data security, control and performance. Leave that to the IT guys. This topic focuses on reference, pricing, transactions and all other data that populates the investment system databases. It's one of the most complex process within the middle office function because a significant number of BAU issues will originate from here. How do you automate and improve the quality of data that goes into your system? Can you trust your source data? How fast does the team resolve breaks, say between custody record and contractual settlement? Does AI have a role to play here and is it worth the investment?",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-10",
    "categories": [
      "Interests"
    ],
    "contents": "\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:39:03+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Building an Innovative and Continuously Improving Team/",
    "title": "Building an Innovative and Continuously Improving Team [Public]",
    "description": "I had a staff who joined our team without any experience in investment. He was not confident enough to deal with many tasks independently and he was afraid to handle communications with the vendors. The first thing I did was to make sure he learn to be really good at one thing. As I trained, I made sure he not only asks questions but challenge me and throw ideas around so he doesn't feel his job is just to follow instructions. He was a fast learner and he became the expert in that subject, giving him the confidence to take on other tasks confidently. I've had other staff who were good at their job but stayed out of contributing to ideas and innovation. It's subjective, but without being too academic, here are some useful pointers.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nThe focus here is on instilling proactive and idea-oriented traits among your team members. It is not a guide on how to build high performance teams that consistently deliver KPI-driven success - there are lots of great coaching programs out there to guide you on that.\nThere are many ways to inspire creativity. But, first things first, cultivate a positive and cheerful environment.\nEngage in informal and relaxed conversations with your staff while maintaining professionalism. Be open and receptive to what they say.\nMotivate. I’m not talking about powerful speeches and fist-pumping actions that move your emotion and mind into an empowered state (only to shrink back the next day). Motivation is an individual thing. With the previous point in mind, you learn what motivates the team member and the team as a whole.\nAllow and encourage them to be open and not to be afraid of speaking up.\nGathering everyone for a meeting expecting ideas to flow there and then does not effectively pick someone’s brains. The best ideas are more likely to come through spontaneously during casual chats and they come in bits and pieces over time for you to put together.\nTrain them well. If possible, personally train them too. It shows respect.\nGuide them from the beginning, or at the very least, give directions. “Throwing them into the sea” does not work for everyone and may demotivate the staff or lead to selfishness in the workplace. You can be more ruthless at a later stage. Genuinely helping people to improve is reciprocated with gratitude and dedication.\nMake sure they don’t get too comfortable and complacent with their responsibilities. Take on different tasks, be all-rounders and stay competitive.\nGive them time to seek new knowledge. Inspire learning and sharing culture. It gives a sense of purpose and value where career and personal development is concerned.\nWhere possible, give them the freedom and flexibility to design their work and set their own goals. It gives them more ownership.\nStop breathing down their necks and spend excessive time on trivial matters, a.k.a. micro-managing. Not only does it irritate people but it puts people on defensive mode which can turn positive attitude into negative. Give them enough breathing space, communicate expectations clearly and fairly. Make a clear distinction between expecting your staff to set their standards to “the department’s level” and to “your level”. The latter is egoism and insecurity. You are not allowing and not trusting that your staff can bring out a better version of your work. It inhibits independence, originality and progress. A homogeneous work culture has the opposite effect of the creative environment you want to foster. Be flexible.\nIf a mistake happens, discuss about immediate resolution first, followed by a review to prevent future occurrence. Pinpointing who should be blamed does not help to resolve the issue any better.\nPenalising for mistakes create a fear of reporting the issue immediately and openly. Be careful how it is implemented. It is meant for everyone to learn from mistakes and improve, not to punish someone who may just be a victim of a weak control structure.\nThere will always be one in the team who is not interested to improve or contribute much and is probably more interested in office politics. These people drag the team down, they’re not worth your time.\nFinal Thoughts\nNo businesses would disagree that ideas, knowledge and innovation play important roles in creating value and adapting to changing business environment. How are some companies able to thrive better than others. I have worked in companies that have very strong top-down approach but survived well (because it is in a somewhat commoditised market). But to survive better, read this excellent article on lean and agile manufacturing and their approach to bottom-up problem-solving. Agile Manufacturing vs Lean Manufacturing: What’s the difference?\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-08T00:20:46+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Critical Risk Areas in the Procurement and Implementation Process/",
    "title": "Critical Risk Areas in the Procurement and Implementation Process",
    "description": "It is a misconception that putting a strong project management in place can mitigate project risks. They are not wrong though, provided that the implementation plan is solid in the first place. However, project managers who have little experience in investment systems will end up just tracking project status. Way before signing the contract, you should know what issues to at least expect and establish a resolution plan. The conversion process is a major risk associated with delays. This is where the blame starts. Reports customisation - why leave it until its too late? There are other risks but my point here is, there is a way to manage these risks and don't leave it to the project managers to think about this. They will not get the answers from the vendors and users. Lastly, when you select the \"wrong\" system, you will have to live and deal with on your own for the next few years.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nLet’s start from the beginning.\nYou want to make major improvements to your operations and ready to explore other IT options that can better support your goals. Next step is perhaps hire an IT or business process consultant to work with you. Finally, you have made your selection in implementing system ABC.\nLet me explain to you why there is certain disconnection between your planned future state, the technology you initially imagined and the resulting implementation.\nConsider these scenarios:\nDesigning a new process. A project to overhaul the operational process usually ends up with a “re-organisation” that gives the impression that processes has improved or works more in tune with the new organisation structure.\nDesigning a new process. Internal team undertake this task with the business consultant. The consultant asks what the team wants. The team looks at the current state and current issues and decide to base the desired state on these factors. The consultant fine tunes the documentation.\nVendor implementation methodology…\nRead more…\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-06T18:22:49+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Dealing with Custodians, Counterparties and Service Partners/",
    "title": "Dealing with Custodians, Counterparties and Service Partners",
    "description": "They say no news is good news. Spending less time with your vendors means less issues. That is the ideal situation as you work seamlessly through the use of their product or services. After all, they say they understand your business very well. Unfortunately, this is not always the case. What you might encounter: they are not responsive, their answers fail to address your concerns, your request is not in their priority list, enhancements won't be considered until the next major release, change management gives you a quote that is out of your current year budget. Can you control these issues before on-boarding your service providers? Yes you can, by at least 50%. Many organisations sign-up not expecting many issues to crop up later because they do not have experienced specialists to consult them. One mistake is to assume the SLA is sufficient to protect them. There will always be gaps and potential issues. Your providers are not going to tell you that because they want you to be aligned to their model and not the other way. Can't blame them since they have many other clients and it is not feasible to allow too much flexibility to fit in to many different requirements.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-06T16:21:13+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Efficient Transition Post Implementation/",
    "title": "Efficient Transition Post-Implementation",
    "description": "A look at the re-organisation of resources, new roles and skills. Managers - don't be so rigid with the new process and KPI. It takes time to develop new processes and knowledge. We also explore issues management, conducting service reviews, how to train staff effectively and setting the foundation for continuous improvement.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:15:12+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Failed Trade,  Delivery and Settlement Issues/",
    "title": "Failed Trade, Delivery and Settlement Issues",
    "description": "You dread the day when it happens. This triggers the panic button and it tends to disrupt an otherwise resourceful day. For a critical trade, following up with custodians/counterparties and escalating this to the fund managers mean there is a lot of explaining to do. From an asset managers perspective, as long as you manage cash flow projections, track settlement status and ensure instructions to custodians are in order, you are good and the rest is beyond your control. But how do you check very quickly that these are in order? Most probably you will be communicating back and forth with your team, but is there a more effcient solution?",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:14:29+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Implementation Tips/",
    "title": "Implementation Tips",
    "description": "I have discussed this before. With some tuning to the timeline and getting the right people for the reports design phase and conversion phase, you will be ready to go live months ahead of schedule. A lot of planning is required but it pays off in the long term.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nRequires password.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-03T02:03:18+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Investment Operations is More Than Just Technology/",
    "title": "Investment Operations Is More Than Just Technology",
    "description": "Let's not get confused between the two. Technology improves the way we work. Operations executes the processes that are designed to attain the desired output. Execution can be performed by either automation or manual work. The ideal state is to shift every process to automation, but even in a fully automated environment, machines can't think for itself and cannot make decisions (for now). As the balance is shifted, roles and relevant skills to manage the processes and execution will change. It is important to distinguish between the two and plan in advance for operational changes before rushing into buying new systems.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:19:07+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Investment Operations Talent and Training in Malaysia/",
    "title": "Investment Operations Talent and Training in Malaysia",
    "description": "This discussion may be disputed by some, but here are some of my experiences and thoughts on why we can do better to improve our skills and knowledge. We are comfortable being followers and let the consultants and vendors lead the way because we don't want to risk being blamed for any failures.  There is lack of innovation in the local industry. Another is the lack of depth and limited choices of training. Too many securities-related training are taken straight out of the textbook, with a few case studies thrown in. Specialised and niche topics relevant to investment operations are less-likely to be well-received by organisers because their target is the mass-market and hence prefer generic topics. We need the right courses out there to build the right skillset. Financial institutions and regulators do not prioritise training nor give enough focus on investment operations - despite the fact that middle and back office staff make up the majority of people in investment organisations and that they perform or support many critical roles such as compliance, monitoring risks, fraud-detection and delivering information.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nFurther reading on my proposals to improve IT and operational skills in the industry. The solution isn’t about providing more training to everyone. There are unique challenges implementing such proposals in Malaysia.\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:20:41+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Operations and Management The Inverted Pyramid/",
    "title": "Operations and Management The Inverted Pyramid",
    "description": "You will probably have heard of the inverted pyramid in an organisation structure. Conceptually, it looks like a great model that creates an effectively-run organisation. But, did some companies interpret the pyramid differently? At the bottom is a proportionately small team of workers doing the \"real\" work, who report to managers who report to more senior managers who report to more senior people. Input and decision-making trickles down one way. Anyone?",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-03T02:28:32+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Outsourcing Pros and Cons/",
    "title": "Outsourcing Pros and Cons",
    "description": "We take a look what functions you can outsource to external parties. Should you outsource your entire middle office or partially outsource some of the functions and keep the rest in-house? We discuss about different configurations that is most suitable for your type of organisation and requirements. Key areas include operational and cost impact, data ownership and control, governance, security, licensing, cloud computing, etc. to assess whether these initiatives are beneficial or restrictive to your objectives.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:23:43+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Risk and Compliance/",
    "title": "Risk and Compliance [Public]",
    "description": "This is undoubtedly a significant and huge topic on its own so much so that every investment management company spend huge resources just to make sure the message is put across all their employees.  Whatever you call your department or the risk area you are operating within - enterprise risk, operational risk, ethics, AML/Sanctions, IT/cyber risk, investment risk, risk management, etc. - there are fundamentally two things that you are trying to protect: the company's reputation and avoiding substantial losses. These can occur from rogue trades, weak contracts, scandals, corruption, mismanagement, pandemic, ignorance of regulations, market conditions, cross-border culture, etc. It is a huge challenge to even ensure these are communicated effectively to employees, let alone preventing it. My former employer, State Street did an impressive job with managing risks and communicating its importance. In future, I hope to write more about risk or even better, invite contributors who are experts in this field. For me, I will focus more on operational risk related to systems implementation and trade cycle (settlement, manual process, technical, etc.). So watch this space.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:27:49+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Should You Build a Data Warehouse/",
    "title": "Should you build a data warehouse",
    "description": "This is a large project on its own. To undertake this project, you need to know: the purpose for using it, if there is reason why you prefer not to pull data directly from source, if your source data is clean and understand the flow of data as it integrates from multiple sources. Otherwise, you would have spent a lot of time building, cleaning and maintaining the data warehouse without eventually serving its purpose. You are better off writing stored procedures or access from Java/R/Python that can guarantee a much higher retention of data integrity and near real-time data. Most BI tools allow you to connect to multiple databases but I wouldn't advise building non-shareable code into reports. Common concern is latency issue but think about optimising your infrastructure. Most databases are designed to handle large numbers of concurrent access. In many cases, it is the front-end applications that are slow. If there are many external programs, eg. risk/performance requiring only selective data, then it make sense to build a simple data warehouse.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:32:21+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 The Future of Reporting/",
    "title": "The Future of Reporting",
    "description": "Preparing reports in Excel and Word, printing paginated reports from Crystal Reports and sending reports manually via emails are some traditional reporting methods that can be phased out but not entirely. We explore the use of BI tools and more advanced programming visualization packages, web-based and mobile applications, and how these can be integrated for effective information delivery within and outside the organisation.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nThese ideas are not new and cannot be regarded as “the future”. Many organisations have been moving into BI over the years but the overall usage is still secondary and supplemental to traditional reports. Learning new skills and viewing reports in a different way are prohibitive factors that explains the slow adoption rate.\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:33:00+08:00",
    "input_file": {}
  },
  {
    "path": "resources/2020-07-01 Why Hire Specialist Consulting Firms and Not the Big Consulting Firms/",
    "title": "Why Hire Specialist Investment Consulting Companies over the Big Consulting Firms",
    "description": "This article potentially invites a storm. It relates to business process re-engineering right through to investment systems implementation. All types of investment systems - front and back-office, risk, performance, etc. Project management and technology are strengths of of these big consulting firms. The rest - selection, testing, POC, conversion, reporting, investment outsourcing - consider other specialists. Implementation of investment systems is not dependent on the most advanced technology or the best project management practices. Its success depends a lot on factors that require strong domain knowledge which I will discuss in detail.",
    "author": [
      {
        "name": "Chen Xihui",
        "url": {}
      }
    ],
    "date": "2020-07-01",
    "categories": [
      "Interests"
    ],
    "contents": "\nI will list out a few specialist consulting firms.\nRequires password\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-07T00:37:45+08:00",
    "input_file": {}
  }
]
